Revit 2024 API
TemporaryViewModes Members
The TemporaryViewModes type exposes the following members.
Methods
Name | Description
DeactivateAllModes
 Deactivates all temporary modes that are currently active.
DeactivateMode
 Deactivates the given temporary mode.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCaption
 A text caption to use for the given mode.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCustomized
 Identifies if a custom temporary view mode is currently active. A custom mode is active if there is a non-empty string set for CustomTitle.
IsModeActive
 Tests whether a given mode is currently active or not.
IsModeAvailable
 Tests whether a temporary view mode is currently available in the associated view.
IsModeEnabled
 Tests whether a temporary view mode is currently enabled in the associated view.
IsValidState
 Tests whether the given state is valid for the associated view and the context the view is currently in.
RemoveCustomization
 Removes all customized values for the TemporaryViewProperties mode.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CustomColor
 Custom color for the TemporaryViewProperties mode.
CustomTitle
 Custom title for the TemporaryViewProperties mode.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PreviewFamilyVisibility
 The current state of the PreviewFamilyVisibility mode in the associated view.
PreviewFamilyVisibilityDefaultOnState
 Controls the default state of the PreviewFamilyVisibility mode in all views.
PreviewFamilyVisibilityDefaultUncutState
 Controls the default type of the On state of the PreviewFamilyVisibility mode in cut-able views.
RevealConstraints
 The current state of the RevealConstraints mode in the associated view.
RevealHiddenElements
 The current state of the RevealHiddenElements mode in the associated view.
WorksharingDisplay
 The current state of the WorksharingDisplay mode in the associated view.
See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace